import React from "react";
import "../styles/home.css";
import spbImg from '../components/images/saint-petersburg.png';
import kalinImg from '../components/images/kaliningrad.jpg';
import moscowImg from '../components/images/moscow.jpg';
import minskImg from '../components/images/minsk.jpg';
import istanbulImg from '../components/images/istanbul.jpg';
import tbilisiImg from '../components/images/tbilisi.jpg';
import kazanImg from '../components/images/kazan.webp';
import dubaiImg from '../components/images/dubai.jpg';
import yerevanImg from '../components/images/yerevan.webp';
import romeImg from '../components/images/rome.jpg';
import guideFieldImg from '../components/images/guide_field.jpg';
import viewImg from '../components/images/view.jpg';

export default function Home() {

  /* массив для попул направл можно добавить если время будет подсчет 
  оличества экскурсий определенного города на карточку (count: 2185)*/
    const cities = [
    { name: "Санкт-Петербург", slug: "saint-petersburg", image: spbImg },
    { name: "Калининград",  slug: "kaliningrad", image: kalinImg },
    { name: "Москва",  slug: "moscow", image: moscowImg },
    { name: "Минск",  slug: "minsk", image: minskImg },
    { name: "Стамбул",  slug: "istanbul", image: istanbulImg },
    { name: "Тбилиси",  slug: "tbilisi", image: tbilisiImg },
    { name: "Казань",  slug: "kazan", image: kazanImg },
    { name: "Дубай",  slug: "dubai", image: dubaiImg },
    { name: "Ереван",  slug: "yerevan", image: yerevanImg },
    { name: "Рим",  slug: "rome", image: romeImg },
  ];

  return (
    <main className="home">
      {/* Баннер */}
      <section className="banner">
        <h1>Необычные экскурсии от местных жителей</h1>
        <p>1 154 экскурсии в 401 городах по всему миру</p>
        <form className="search-form">
          <div className="search-bar-banner">
                  <svg
                  className="search-icons"
                  width="18"
                  height="18"
                  viewBox="0 0 18 18"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path d="M11.7321 10.3182H10.9907L10.7279 10.065C11.8541 8.7518 12.436 6.96032 12.1169 5.05624C11.6758 2.44869 9.4984 0.366386 6.87055 0.0474864C2.90061 -0.440264 -0.440517 2.89891 0.0475131 6.86652C0.366613 9.4928 2.45012 11.6689 5.05921 12.1098C6.9644 12.4287 8.757 11.8471 10.0709 10.7216L10.3243 10.9842V11.7252L14.313 15.7116C14.6978 16.0961 15.3266 16.0961 15.7114 15.7116C16.0962 15.327 16.0962 14.6986 15.7114 14.314L11.7321 10.3182ZM6.10096 10.3182C3.76405 10.3182 1.87763 8.4329 1.87763 6.09739C1.87763 3.76184 3.76405 1.87653 6.10096 1.87653C8.4379 1.87653 10.3243 3.76184 10.3243 6.09739C10.3243 8.4329 8.4379 10.3182 6.10096 10.3182Z" fill="#202020"/>
            </svg>
            <input type="text" placeholder="Куда вы хотите поехать?" />
          </div>

          <input type="text" className="date-input" placeholder="Когда? (необязательно)" />
          <button type="submit">Найти</button>
        </form>
      </section>

      {/* Популярные направления */}     
      <section className="popular">
        <h2>Самые популярные направления</h2>
          <div className="card">
            {cities.map((city) => (
              <a 
              href={`/excursions/${city.slug}`}
              className={`city-card ${city.slug === 'rome' ? 'hide-on-mobile' : ''}`}
              key={city.slug}
              style={{ backgroundImage: `url(${city.image})` }}
              >
                <div className="card-overlay">
                <h3>{city.name}</h3>
                {/*<p>{city.count} экскурсий</p>*/}
                </div>
              </a>
            ))}
          </div>
          {/*кнопка*/}
          <a href="/excursions" className="btn">Посмотреть все экскурсии</a>
      </section>

      {/* Уникальный формат */}
      <section className="features">
        <div className="features-inner">
          <div className="features1">
            <svg 
            className="features-icons"
            width="80" 
            height="80" 
            viewBox="0 0 80 80" 
            fill="none" 
            xmlns="http://www.w3.org/2000/svg">
            <path d="M56.6667 70V63.3333C56.6667 59.7971 55.262 56.4057 52.7615 53.9052C50.261 51.4048 46.8696 50 43.3334 50H16.6667C13.1305 50 9.7391 51.4048 7.23862 53.9052C4.73813 56.4057 3.33337 59.7971 3.33337 63.3333V70M76.6667 70V63.3333C76.6645 60.3791 75.6812 57.5092 73.8713 55.1744C72.0613 52.8395 69.5271 51.1719 66.6667 50.4333M53.3334 10.4333C56.2014 11.1677 58.7435 12.8357 60.5588 15.1744C62.3742 17.5131 63.3595 20.3894 63.3595 23.35C63.3595 26.3106 62.3742 29.1869 60.5588 31.5256C58.7435 33.8643 56.2014 35.5323 53.3334 36.2667M43.3334 23.3333C43.3334 30.6971 37.3638 36.6667 30 36.6667C22.6362 36.6667 16.6667 30.6971 16.6667 23.3333C16.6667 15.9695 22.6362 10 30 10C37.3638 10 43.3334 15.9695 43.3334 23.3333Z" stroke="#1E1E1E" stroke-width="4" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>
            <div>
              <h2>Увлеченные гиды</h2>
              <p>Тысячи неравнодушных гидов, 
                увлекать для которых — это призвание</p>
            </div>
          </div>

          <div className="features1">
            <svg 
            className="features-icons"
            width="80" 
            height="80" 
            viewBox="0 0 80 80" 
            fill="none" 
            xmlns="http://www.w3.org/2000/svg">
            <path d="M40.0001 73.3334C58.4096 73.3334 73.3334 58.4096 73.3334 40.0001C73.3334 21.5906 58.4096 6.66675 40.0001 6.66675C21.5906 6.66675 6.66675 21.5906 6.66675 40.0001C6.66675 58.4096 21.5906 73.3334 40.0001 73.3334Z" stroke="#1E1E1E" stroke-width="4" stroke-linecap="round" stroke-linejoin="round"/>
            <path d="M54.1334 25.8667L47.0667 47.0667L25.8667 54.1334L32.9334 32.9334L54.1334 25.8667Z" stroke="#1E1E1E" stroke-width="4" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>
            <div>
              <h2>Необычные экскурсии</h2>
              <p>Авторские, познавательные,
                индивидуальные и групповые
                программы на русском языке</p>
            </div>
          </div>
        </div>

      </section>

      {/* 2 банера*/}
      <section className="promo promo--light">
        <div className="promo-inner">
          <h2>Лучшие гиды по всему миру</h2>
          <p>Планируйте путешествия на ходу</p>
          <a href="/guides" className="btn">Найти своего гида</a>
        </div>
      </section>

      <section className="promo promo--dark">
        <div className="promo-inner">
          <h2>Многодневные туры по всему миру</h2>
          <p>Дольше путешествие — больше открытий</p>
          <a href="/excursions" className="btn">Найти свою экскурсию</a>
        </div>
      </section>

      {/* Приглашение стать гидом */}
      <section className="dual-conversion">
        <div className="conversion-inner">

          <div className="conversion-block conversion--guide">
            <h2>Хотите стать гидом GlobalGid?</h2>
            <p>Наш эксперт позвонит вам в течении 10 минут</p>
            <form className="guide-form">
              <input type="text" placeholder="Имя" />
              <input type="tel" placeholder="Телефон" />
              <button type="submit">Отправить заявку</button>
              <small>
                Нажимая кнопку «Отправить заявку», я даю свое согласие на обработку моих персональных данных.
              </small>
            </form>
            <img src={guideFieldImg} alt="Гиды в поле" />
          </div>

          <div className="conversion-block conversion--social">
            <h2>Следите за нашим блогом в социальных сетях</h2>
            <p>
              Новые направления, экскурсии и туры, самые интересные места, статьи от местных экспертов, гидов и организаторов
            </p>
            <div className="social-icons">

              <a href="https://vk.com/globalgid">
              <svg width="56" 
              height="56" 
              viewBox="0 0 56 56" 
              fill="none" 
              xmlns="http://www.w3.org/2000/svg">
              <path d="M52.5 28C52.5 34.4977 49.9188 40.7295 45.3241 45.3241C40.7295 49.9188 34.4977 52.5 28 52.5C21.5023 52.5 15.2705 49.9188 10.6759 45.3241C6.08125 40.7295 3.5 34.4977 3.5 28C3.5 21.5023 6.08125 15.2705 10.6759 10.6759C15.2705 6.08125 21.5023 3.5 28 3.5C34.4977 3.5 40.7295 6.08125 45.3241 10.6759C49.9188 15.2705 52.5 21.5023 52.5 28ZM28.8788 21.5871C26.4962 22.5794 21.731 24.6313 14.5893 27.7428C13.4317 28.2021 12.8222 28.6554 12.7671 29.0964C12.6753 29.8405 13.6093 30.1346 14.8803 30.5357L15.4162 30.7043C16.6657 31.1115 18.3502 31.5861 19.2229 31.6045C20.0191 31.6229 20.9041 31.2984 21.8811 30.6246C28.5542 26.1196 31.9996 23.8441 32.214 23.7951C32.3671 23.7585 32.5815 23.7157 32.7224 23.8441C32.8664 23.9698 32.851 24.2116 32.8358 24.276C32.7439 24.671 29.078 28.0766 27.1822 29.8406C26.5912 30.3917 26.1716 30.7807 26.0858 30.8696C25.8972 31.0625 25.7052 31.2524 25.5101 31.4393C24.3463 32.56 23.4768 33.3993 25.5561 34.7713C26.5577 35.4328 27.3598 35.9748 28.1592 36.5199C29.029 37.114 29.8988 37.705 31.0257 38.4461C31.3106 38.6298 31.5861 38.829 31.8526 39.0189C32.8664 39.7416 33.782 40.3909 34.906 40.2868C35.5614 40.2255 36.2381 39.613 36.5811 37.7755C37.3928 33.436 38.9883 24.0371 39.3558 20.163C39.3782 19.841 39.3648 19.5174 39.3158 19.1984C39.2872 18.941 39.1625 18.7037 38.9669 18.5337C38.6881 18.3414 38.356 18.2418 38.0175 18.249C37.0988 18.2642 35.6807 18.7574 28.8788 21.5871Z" fill="#202020"/></svg></a>

              <a href="https://t.me/globalgid">
              <svg width="56" 
              height="56" 
              viewBox="0 0 56 56" 
              fill="none" 
              xmlns="http://www.w3.org/2000/svg">
              <path d="M35.1922 4.55078C48.3242 4.55078 51.4507 7.67745 51.4507 20.8094V35.1921C51.4507 48.3241 48.3242 51.4509 35.1922 51.4509H20.8095C7.67745 51.4509 4.55078 48.3241 4.55078 35.1921V20.8094C4.55078 7.67745 7.67745 4.55078 20.8095 4.55078H35.1922ZM16.7644 19.2071H13.3446C12.3675 19.2071 12.1721 19.667 12.1721 20.1742C12.1721 21.08 13.3315 25.5726 17.5704 31.5143C20.3963 35.5721 24.3779 37.7716 28.0009 37.7716C30.1746 37.7716 30.4436 37.283 30.4436 36.4416V33.3748C30.4436 32.3977 30.6495 32.2026 31.3378 32.2026C31.8451 32.2026 32.7145 32.4564 34.7435 34.4127C37.0622 36.7314 37.4444 37.7716 38.7487 37.7716H42.1686C43.1456 37.7716 43.6342 37.283 43.3524 36.319C43.0439 35.358 41.9369 33.964 40.4679 32.3113C39.6708 31.3694 38.4752 30.3549 38.1129 29.8476C37.6056 29.1956 37.7507 28.9056 38.1129 28.326L38.1738 28.2397C38.689 27.5073 42.3105 22.3144 42.7142 20.4641C42.9316 19.7395 42.7142 19.2071 41.68 19.2071H38.2603C37.3907 19.2071 36.9898 19.667 36.7724 20.1742C36.7724 20.1742 35.0333 24.4132 32.5696 27.1666C31.7727 27.9638 31.4103 28.2173 30.9756 28.2173C30.7582 28.2173 30.4436 27.9638 30.4436 27.2391V20.4641C30.4436 19.5946 30.1912 19.2071 29.4665 19.2071H24.0925C23.5491 19.2071 23.2224 19.6107 23.2224 19.993C23.2224 20.8175 24.454 21.0075 24.5811 23.3263V28.3622C24.5811 29.4665 24.3817 29.6667 23.9469 29.6667C22.7875 29.6667 19.9675 25.4088 18.2949 20.5366C17.9671 19.5895 17.6385 19.2071 16.7644 19.2071Z" fill="#202020"/></svg></a>

              <a href="https://youtube.com/globalgid">
              <svg width="56" 
              height="56" 
              viewBox="0 0 56 56" 
              fill="none" 
              xmlns="http://www.w3.org/2000/svg">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M27.9616 4.19922C27.8379 14.1288 27.1587 19.7108 23.4339 23.4362C19.7088 27.1616 14.1276 27.8406 4.19922 27.9645C4.58049 15.0115 15.0109 4.58053 27.9616 4.19922ZM33.9594 23.4362C30.2344 19.7108 29.5555 14.1288 29.4316 4.19922C42.3823 4.58053 52.8127 15.0114 53.194 27.9645C43.2657 27.8406 37.6843 27.1616 33.9594 23.4362ZM4.19922 29.4336C4.58049 42.3866 15.0109 52.8176 27.9616 53.199C27.8379 43.2693 27.1587 37.6873 23.4339 33.9619C19.7088 30.2365 14.1276 29.5575 4.19922 29.4336ZM33.9575 33.9619C37.6824 30.2365 43.2636 29.5575 53.1921 29.4336C52.8108 42.3866 42.3804 52.8176 29.4297 53.199C29.5534 43.2693 30.2326 37.6873 33.9575 33.9619Z" fill="#202020"/></svg></a>

              <a href="https://zen.yandex.ru/globalgid">
              <svg width="56" 
              height="56" 
              viewBox="0 0 56 56" 
              fill="none" 
              xmlns="http://www.w3.org/2000/svg">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M4.66675 25.0832C4.66675 16.8905 4.66675 12.7941 6.63293 9.85151C7.48411 8.57763 8.57788 7.48386 9.85175 6.63268C12.7944 4.6665 16.8907 4.6665 25.0834 4.6665H30.9168C39.1094 4.6665 43.2058 4.6665 46.1485 6.63268C47.4223 7.48386 48.516 8.57763 49.3672 9.85151C51.3334 12.7941 51.3334 16.8905 51.3334 25.0832V30.9165C51.3334 39.1092 51.3334 43.2055 49.3672 46.1481C48.516 47.4221 47.4223 48.5159 46.1485 49.3671C43.2058 51.3332 39.1094 51.3332 30.9168 51.3332H25.0834C16.8907 51.3332 12.7944 51.3332 9.85175 49.3671C8.57788 48.5159 7.48411 47.4221 6.63293 46.1481C4.66675 43.2055 4.66675 39.1092 4.66675 30.9165V25.0832ZM20.2691 20.6928C20.2691 16.3521 23.7878 12.8332 28.1287 12.8332C32.4696 12.8332 35.9883 16.3521 35.9883 20.6928C35.9883 25.0337 32.4696 28.5527 28.1287 28.5527C23.7878 28.5527 20.2691 25.0337 20.2691 20.6928ZM24.8797 20.693C24.8797 22.4872 26.3344 23.942 28.1287 23.942C29.923 23.942 31.3778 22.4872 31.3778 20.693C31.3778 18.8985 29.923 17.4439 28.1287 17.4439C26.3344 17.4439 24.8797 18.8985 24.8797 20.693ZM36.035 32.5987C35.9353 32.6787 34.0498 34.1688 30.9032 34.8099L35.6528 39.5172C36.4879 40.3511 36.489 41.7042 35.6551 42.5393C34.8212 43.3745 33.4683 43.3758 32.6329 42.5417L28.0218 38.0514L23.8337 42.5128C23.4144 42.9477 22.8551 43.1665 22.2953 43.1665C21.7612 43.1665 21.2267 42.9678 20.812 42.568C19.9623 41.7486 19.9377 40.3957 20.757 39.5461L25.2652 34.8347C22.0305 34.2087 20.067 32.6799 19.966 32.5987C19.0452 31.8604 18.8973 30.5154 19.6356 29.5945C20.3739 28.6738 21.7188 28.526 22.6398 29.2643C22.6593 29.28 24.7129 30.8227 28.0218 30.8249C31.3307 30.8227 33.3418 29.28 33.3612 29.2643C34.2821 28.526 35.6269 28.6738 36.3653 29.5945C37.1038 30.5154 36.9559 31.8604 36.035 32.5987Z" fill="#202020"/></svg></a>
            </div>

            <img src={viewImg} alt="Гид на вершине" />
          </div>

        </div>
      </section>

    </main>
  );
}
